---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailConnectionOption.Trim
enum: Autodesk.Revit.DB.Architecture.RailConnectionOption
zh: 修剪
source: html/8cbeb5fd-2eab-c387-b499-869cedb44a19.htm
---
# Autodesk.Revit.DB.Architecture.RailConnectionOption.Trim

**中文**: 修剪

Rails will be trimmed and cut with a vertical plane.